In [1]:
# DataFrame Operati

In [5]:
import numpy as np
import pandas as pd

In [6]:
myDictionary = {"james": [40,30,np.nan], "alex" : [20, np.nan, 50], "rob" : [30,50,40]}

In [7]:
myDictionary

{'james': [40, 30, nan], 'alex': [20, nan, 50], 'rob': [30, 50, 40]}

In [8]:
myDataFrame = pd.DataFrame(myDictionary)

In [9]:
myDataFrame

   james  alex  rob
0   40.0  20.0   30
1   30.0   NaN   50
2    NaN  50.0   40

In [10]:
myDataFrame.dropna()

   james  alex  rob
0   40.0  20.0   30

In [11]:
myDataFrame

   james  alex  rob
0   40.0  20.0   30
1   30.0   NaN   50
2    NaN  50.0   40

In [12]:
myDataFrame.dropna(axis = 1)

   rob
0   30
1   50
2   40

In [13]:
myDictionary = {"james": [40,30,np.nan], "alex" : [20, np.nan, 50], "rob" : [30,50,40],"mark" : [45,np.nan,np.nan]}

In [14]:
my_newDataFrame = pd.DataFrame(myDictionary)

In [15]:
my_newDataFrame

   james  alex  rob  mark
0   40.0  20.0   30  45.0
1   30.0   NaN   50   NaN
2    NaN  50.0   40   NaN

In [24]:
my_newDataFrame.dropna(axis = 1, thresh=2)

   james  alex  rob
0   40.0  20.0   30
1   30.0   NaN   50
2    NaN  50.0   40

In [25]:
my_newDataFrame

   james  alex  rob  mark
0   40.0  20.0   30  45.0
1   30.0   NaN   50   NaN
2    NaN  50.0   40   NaN

In [26]:
my_newDataFrame.fillna(20)

   james  alex  rob  mark
0   40.0  20.0   30  45.0
1   30.0  20.0   50  20.0
2   20.0  50.0   40  20.0

In [27]:
#groupby

In [37]:
salaray_dict = {"Programin Language" : ["Python","Python","Python","Java","Java","Swift"], "Name" : ["A","B","C","D","E","F"], "Salary" : [100,90,80,70,60,50]}

In [38]:
salary_frame = pd.DataFrame(salaray_dict)

In [39]:
salary_frame

  Programin Language Name  Salary
0             Python    A     100
1             Python    B      90
2             Python    C      80
3               Java    D      70
4               Java    E      60
5              Swift    F      50

In [42]:
group_object = salary_frame.groupby("Programin Language")

In [43]:
group_object

In [44]:
group_object.count()

                    Name  Salary
Programin Language
Java                   2       2
Python                 3       3
Swift                  1       1

In [45]:
group_object.mean()

C:\Users\soner\AppData\Local\Temp\ipykernel_12804\3749447628.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group_object.mean()

                    Salary
Programin Language
Java                  65.0
Python                90.0
Swift                 50.0

In [47]:
group_object.min()

                   Name  Salary
Programin Language
Java                  D      60
Python                A      80
Swift                 F      50

In [48]:
group_object.max()

                   Name  Salary
Programin Language
Java                  E      70
Python                C     100
Swift                 F      50

In [49]:
group_object.min("Salary")

                    Salary
Programin Language
Java                    60
Python                  80
Swift                   50

In [50]:
group_object.max("Salary")

                    Salary
Programin Language
Java                    70
Python                 100
Swift                   50

In [52]:
help(group_object.min)

Help on method min in module pandas.core.groupby.groupby:

min(numeric_only: 'bool' = False, min_count: 'int' = -1, engine: 'str | None' = None, engine_kwargs: 'dict[str, bool] | None' = None) method of pandas.core.groupby.generic.DataFrameGroupBy instance
    Compute min of group values.

    Parameters
    ----------
    numeric_only : bool, default False
        Include only float, int, boolean columns. If None, will attempt to use
        everything, then use only numeric data.
    min_count : int, default -1
        The required number of valid values to perform the operation. If fewer
        than ``min_count`` non-NA values are present the result will be NA.

    Returns
    -------
    Series or DataFrame
        Computed min of values within each group.

In [53]:
group_object.min(numeric_only=True)

                    Salary
Programin Language
Java                    60
Python                  80
Swift                   50

In [54]:
group_object.describe()

                   Salary
                    count  mean        std   min   25%   50%   75%    max
Programin Language
Java                  2.0  65.0   7.071068  60.0  62.5  65.0  67.5   70.0
Python                3.0  90.0  10.000000  80.0  85.0  90.0  95.0  100.0
Swift                 1.0  50.0        NaN  50.0  50.0  50.0  50.0   50.0

In [55]:
# Other operation"

In [56]:
my_dict1 = {"Name" : ["A","B","C","D"],
           "Sports" : ["Basketball", "Football","Tennis","Running"],
           "Calories" : [100,200,300,400]}

In [68]:
my_frame1 = pd.DataFrame(my_dict1, index=[0,1,2,3])

In [69]:
my_frame1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [59]:
my_dict2 = {"Name" : ["E","F","G","H"],
           "Sports" : ["Basketball", "Football","Tennis","Running"],
           "Calories" : [200,50,330,440]}

In [71]:
my_frame2 = pd.DataFrame(my_dict2,index=[4,5,6,7])

In [72]:
my_frame2

  Name      Sports  Calories
4    E  Basketball       200
5    F    Football        50
6    G      Tennis       330
7    H     Running       440

In [73]:
my_dict3 = {"Name" : ["I","J","K","L"],
           "Sports" : ["Basketball", "Football","Tennis","Running"],
           "Calories" : [300,150,320,410]}

In [74]:
my_frame3 = pd.DataFrame(my_dict3,index=[8,9,10,11])

In [75]:
my_frame3

   Name      Sports  Calories
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       320
11    L     Running       410

In [76]:
#concatenation

In [77]:
pd.concat([my_frame1,my_frame2,my_frame3])

   Name      Sports  Calories
0     A  Basketball       100
1     B    Football       200
2     C      Tennis       300
3     D     Running       400
4     E  Basketball       200
5     F    Football        50
6     G      Tennis       330
7     H     Running       440
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       320
11    L     Running       410

In [79]:
#merge

In [80]:
my_frame1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [81]:
my_frame2

  Name      Sports  Calories
4    E  Basketball       200
5    F    Football        50
6    G      Tennis       330
7    H     Running       440

In [82]:
pd.merge(my_frame1,my_frame2, on="Sports")

  Name_x      Sports  Calories_x Name_y  Calories_y
0      A  Basketball         100      E         200
1      B    Football         200      F          50
2      C      Tennis         300      G         330
3      D     Running         400      H         440

In [85]:
new_salary_frame = pd.DataFrame({"Name" : ["Rob","Mark","Alex",], "Salary" : [10,20,30], "Age" : [50,60,70]})

In [86]:
new_salary_frame

   Name  Salary  Age
0   Rob      10   50
1  Mark      20   60
2  Alex      30   70

In [91]:
new_salary_frame["Name"].unique()

array(['Rob', 'Mark', 'Alex'], dtype=object)

In [92]:
new_salary_frame["Name"].nunique()

3

In [95]:
def grossToNet(salary):
    return salary * 0.65

In [96]:
new_salary_frame["Salary"].apply(grossToNet)

0     6.5
1    13.0
2    19.5
Name: Salary, dtype: float64